Revit 2027 API
CurtainGridLine.SkippedSegmentCurves Property
Retrieve all the removed segment curves of the grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray SkippedSegmentCurves { get; }
Public ReadOnly Property SkippedSegmentCurves As CurveArray
	Get
public:
property CurveArray^ SkippedSegmentCurves {
	CurveArray^ get ();
}
member SkippedSegmentCurves : CurveArray with get
Property Value
CurveArray
Remarks
User can get these curves and then call the method AddSegment() to add the segments to the grid line.
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace